## Analytic Functions – Windowing

Let us go through the list of Windowing functions supported by Postgres.

* `lead` and `lag`
* `first_value` and `last_value`
* We can either use `ORDER BY sort_column` or `PARTITION BY partition_column ORDER BY sort_column` while using Windowing Functions.

In [8]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [9]:
%env DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

env: DATABASE_URL=postgresql://itversity_retail_user:retail_password@localhost:5432/itversity_retail_db

### Getting LEAD and LAG values

Let us understand LEAD and LAG functions to get column values from following or prior records.

```{note}
Here is the example to get values from either immediate prior or following record along with values from curent record. We will get values from prior or following record based on `ORDER BY` within `OVER` Clause.
```

In [10]:
%%sql

SELECT t.*,
    lead(order_date) OVER (ORDER BY order_date DESC) AS prior_date,
    lead(revenue) OVER (ORDER BY order_date DESC) AS prior_revenue,
    lag(order_date) OVER (ORDER BY order_date) AS lag_prior_date,
    lag(revenue) OVER (ORDER BY order_date) AS lag_prior_revenue
FROM daily_revenue AS t
ORDER BY order_date DESC
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2014, 7, 24, 0, 0), Decimal('50885.19'), datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23'), datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23')),
 (datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23'), datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24'), datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24')),
 (datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24'), datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70'), datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70')),
 (datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70'), datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45'), datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45')),
 (datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45'), datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99'), datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99')),
 (datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99'), datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60'), datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60')),
 (datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60'), datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77'), datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77')),
 (datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77'), datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92'), datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92')),
 (datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92'), datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23'), datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23')),
 (datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23'), datetime.datetime(2014, 7, 14, 0, 0), Decimal('29937.52'), datetime.datetime(2014, 7, 14, 0, 0), Decimal('29937.52'))]

```{note}
Here is the example to get values from either prior or following 7th record along with values from current record.
```

In [11]:
%%sql

SELECT t.*,
    lead(order_date, 7) OVER (ORDER BY order_date DESC) AS prior_date,
    lead(revenue, 7) OVER (ORDER BY order_date DESC) AS prior_revenue
FROM daily_revenue t
ORDER BY order_date DESC
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2014, 7, 24, 0, 0), Decimal('50885.19'), datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77')),
 (datetime.datetime(2014, 7, 23, 0, 0), Decimal('38795.23'), datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92')),
 (datetime.datetime(2014, 7, 22, 0, 0), Decimal('36717.24'), datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23')),
 (datetime.datetime(2014, 7, 21, 0, 0), Decimal('51427.70'), datetime.datetime(2014, 7, 14, 0, 0), Decimal('29937.52')),
 (datetime.datetime(2014, 7, 20, 0, 0), Decimal('60047.45'), datetime.datetime(2014, 7, 13, 0, 0), Decimal('40410.99')),
 (datetime.datetime(2014, 7, 19, 0, 0), Decimal('38420.99'), datetime.datetime(2014, 7, 12, 0, 0), Decimal('38449.77')),
 (datetime.datetime(2014, 7, 18, 0, 0), Decimal('43856.60'), datetime.datetime(2014, 7, 11, 0, 0), Decimal('29596.32')),
 (datetime.datetime(2014, 7, 17, 0, 0), Decimal('36384.77'), datetime.datetime(2014, 7, 10, 0, 0), Decimal('47826.02')),
 (datetime.datetime(2014, 7, 16, 0, 0), Decimal('43011.92'), datetime.datetime(2014, 7, 9, 0, 0), Decimal('36929.91')),
 (datetime.datetime(2014, 7, 15, 0, 0), Decimal('53480.23'), datetime.datetime(2014, 7, 8, 0, 0), Decimal('50434.81'))]

```{note}
For values related to non existing prior or following record, we will get nulls.
```

In [12]:
%%sql

SELECT t.*,
    lead(order_date, 7) OVER (ORDER BY order_date DESC) AS prior_date,
    lead(revenue, 7) OVER (ORDER BY order_date DESC) AS prior_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), None, None),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), None, None),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), None, None),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), None, None),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), None, None),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), None, None),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), None, None),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'))]

```{note}
We can replace nulls by passing relevant values as 3rd argument. However, the data type of the values should be compatible with the columns on which `lead` or `lag` is applied.
```

In [13]:
%%sql

SELECT t.*,
    lead(order_date, 7) OVER (ORDER BY order_date DESC) AS prior_date,
    lead(revenue, 7, 0.0) OVER (ORDER BY order_date DESC) AS prior_revenue
FROM daily_revenue t
ORDER BY order_date
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 28, 0, 0), Decimal('35672.03'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 29, 0, 0), Decimal('54579.70'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 30, 0, 0), Decimal('49329.29'), None, Decimal('0.0')),
 (datetime.datetime(2013, 7, 31, 0, 0), Decimal('59212.49'), None, Decimal('0.0')),
 (datetime.datetime(2013, 8, 1, 0, 0), Decimal('49160.08'), datetime.datetime(2013, 7, 25, 0, 0), Decimal('31547.23')),
 (datetime.datetime(2013, 8, 2, 0, 0), Decimal('50688.58'), datetime.datetime(2013, 7, 26, 0, 0), Decimal('54713.23')),
 (datetime.datetime(2013, 8, 3, 0, 0), Decimal('43416.74'), datetime.datetime(2013, 7, 27, 0, 0), Decimal('48411.48'))]

In [14]:
%%sql

SELECT * FROM daily_product_revenue 
ORDER BY order_date, revenue DESC
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'))]

In [15]:
%%sql

SELECT t.*,
    LEAD(order_item_product_id) OVER (
        PARTITION BY order_date 
        ORDER BY revenue DESC
    ) next_product_id,
    LEAD(revenue) OVER (
        PARTITION BY order_date 
        ORDER BY revenue DESC
    ) next_revenue
FROM daily_product_revenue t
ORDER BY order_date, revenue DESC
LIMIT 30

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
30 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 191, Decimal('5099.49')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 957, Decimal('4499.70')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 365, Decimal('3359.44')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 1073, Decimal('2999.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 1014, Decimal('2798.88')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 403, Decimal('1949.85')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 502, Decimal('1650.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 627, Decimal('1079.73')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 226, Decimal('599.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 24, Decimal('319.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96'), 821, Decimal('207.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96'), 625, Decimal('199.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'), 705, Decimal('119.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99'), 572, Decimal('119.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97'), 666, Decimal('109.99')),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99'), 725, Decimal('108.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00'), 134, Decimal('100.00')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00'), 906, Decimal('99.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96'), 828, Decimal('95.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97'), 810, Decimal('79.96')),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96'), 924, Decimal('79.95')),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95'), 926, Decimal('79.95')),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95'), 93, Decimal('74.97')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97'), 835, Decimal('63.98')),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'), 897, Decimal('49.98')),
 (datetime.datetime(2013, 7, 25, 0, 0), 897, Decimal('49.98'), None, None),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 365, Decimal('7978.67')),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 957, Decimal('6899.54')),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 191, Decimal('6799.32')),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 1014, Decimal('4798.08'))]

### Getting first and last values

Let us see how we can get first and last value based on the criteria. `min` or `max` can be used to get only the min or max of the metric we are interested in, however we cannot get other attributes of those records.

Here is the example of using first_value.

In [16]:
%%sql

SELECT t.*,
    first_value(order_item_product_id) OVER (
        PARTITION BY order_date ORDER BY revenue DESC
    ) first_product_id,
    first_value(revenue) OVER (
        PARTITION BY order_date ORDER BY revenue DESC
    ) first_revenue,
    max(revenue) OVER (
        PARTITION BY order_date
    ) max_revenue
FROM daily_product_revenue t
ORDER BY order_date, revenue DESC
LIMIT 10

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
10 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 1004, Decimal('5599.72'), Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 1004, Decimal('5599.72'), Decimal('5599.72'))]

Let us see an example with last_value. While using last_value we need to specify **ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING**.
* By default it uses `ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW`.
* The last value with in `UNBOUNDED PRECEDING AND CURRENT ROW` will be current record.
* To get the right value, we have to change the windowing clause to `ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING`.

In [17]:
%%sql

SELECT t.*,
    last_value(order_item_product_id) OVER (
        PARTITION BY order_date ORDER BY revenue    
        ROWS BETWEEN CURRENT ROW AND UNBOUNDED FOLLOWING
    ) last_product_id,
    max(revenue) OVER (
        PARTITION BY order_date
    ) last_revenue
FROM daily_product_revenue AS t
ORDER BY order_date, revenue DESC
LIMIT 30

 * postgresql://itversity_retail_user:***@localhost:5432/itversity_retail_db
30 rows affected.

[(datetime.datetime(2013, 7, 25, 0, 0), 1004, Decimal('5599.72'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 191, Decimal('5099.49'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 957, Decimal('4499.70'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 365, Decimal('3359.44'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1073, Decimal('2999.85'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 1014, Decimal('2798.88'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 403, Decimal('1949.85'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 502, Decimal('1650.00'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 627, Decimal('1079.73'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 226, Decimal('599.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 24, Decimal('319.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 821, Decimal('207.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 625, Decimal('199.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 705, Decimal('119.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 572, Decimal('119.97'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 666, Decimal('109.99'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 725, Decimal('108.00'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 134, Decimal('100.00'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 906, Decimal('99.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 828, Decimal('95.97'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 810, Decimal('79.96'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 924, Decimal('79.95'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 926, Decimal('79.95'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 93, Decimal('74.97'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 835, Decimal('63.98'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 25, 0, 0), 897, Decimal('49.98'), 1004, Decimal('5599.72')),
 (datetime.datetime(2013, 7, 26, 0, 0), 1004, Decimal('10799.46'), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 26, 0, 0), 365, Decimal('7978.67'), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 26, 0, 0), 957, Decimal('6899.54'), 1004, Decimal('10799.46')),
 (datetime.datetime(2013, 7, 26, 0, 0), 191, Decimal('6799.32'), 1004, Decimal('10799.46'))]